### 데이터베이스

##### SQLite
: 가볍게 파일 하나로 사용할 수 있는 데이터베이스

In [1]:
import sqlite3

In [2]:
# sqlite 데이터베이스 연결하기
dbPath = '../Data/test.sqlite'
conn = sqlite3.connect(dbPath)

# 테이블을 생성하고 데이터 넣기
curs = conn.cursor()
curs.executescript(
    """
    /* items 테이블이 이미 있다면 제거하기 */
    DROP TABLE IF EXISTS items;

    /* 테이블 생성하기 */
    CREATE TABLE items (
        item_id INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT UNIQUE,
        price INTEGER
    );

    /* 데이터 넣기 */
    INSERT INTO items(name, price) VALUES('Apple', 800);
    INSERT INTO items(name, price) VALUES('ORANGE', 780);
    INSERT INTO items(name, price) VALUES('Banana', 430);
    """
)

# 위의 작업을 데이터베이스에 반영하기
conn.commit()

In [3]:
# 데이터 추출하기
curs = conn.cursor()
curs.execute('SELECT * FROM items')
item_list = curs.fetchall()
print(item_list)

[(1, 'Apple', 800), (2, 'ORANGE', 780), (3, 'Banana', 430)]

In [7]:
for i in item_list:
    print(i)

(1, 'Apple', 800)
(2, 'ORANGE', 780)
(3, 'Banana', 430)

In [8]:
filePath = '../Data/test2.sqlite'
conn = sqlite3.connect(filePath)

# 테이블 생성하기
curs = conn.cursor()
curs.execute('DROP TABLE IF EXISTS items')
curs.execute(
    """
    CREATE TABLE items (
        item_id INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT UNIQUE,
        price INTEGER
    );
    """
)

conn.commit()

In [9]:
# 데이터 넣기
curs = conn.cursor()
curs.execute('INSERT INTO items (name, price) VALUES (?, ?)', ('ORANGE', 780))
conn.commit()

In [10]:
curs = conn.cursor()
curs.execute('SELECT * FROM items')
item_list = curs.fetchall()
print(item_list)

[(1, 'ORANGE', 780)]

In [13]:
# 여러 데이터를 연속으로 넣기

curs = conn.cursor()
data = [('Mango', 7700), ('Kiwi', 4000), ('Peach', 9400), ('Persimmon', 7000), ('Banana', 4000)]
curs.executemany('INSERT INTO items (name, price) VALUES (?, ?)', data)
conn.commit()

In [19]:
curs = conn.cursor()
curs.execute('SELECT * FROM items WHERE price BETWEEN ? AND ?', (4000, 7000))
item_list = curs.fetchall()
for i in item_list:
    print(i)

(3, 'Kiwi', 4000)
(5, 'Persimmon', 7000)
(6, 'Banana', 4000)

---
### MySQL

In [20]:
# !pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 43.8/43.8 kB 2.8 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [21]:
import pymysql

In [37]:
# Connection
conn = pymysql.connect(host='127.0.0.1', user='root', password='qwer1234', db='education', charset='utf8')

In [39]:
# Cursor
curs = conn.cursor()

In [25]:
sql  = 'SELECT * FROM student'
curs.execute(sql)

10

In [26]:
rows = curs.fetchall()
print(rows)

(('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과3', '678-9012', None), ('S010', 'James', 'Computer', '1234', None), ('S777', 'Cathy', 'Math', '12345', None), ('S888', 'James', 'math', '1234', None), ('S999', '홍길동', '컴공', '123', None))

In [28]:
# List로 변환
rowList = list(rows)
rowList

[('S001', '박소명', '컴퓨터공학과', '123-4567', None),
 ('S002', '최민국', '컴퓨터공학과', '234-5678', None),
 ('S003', '이승호', '국문학과', '345-6789', None),
 ('S004', '정수봉', '국문학과', '456-7890', None),
 ('S005', '김상진', '사학과', '567-8901', None),
 ('S006', '황정숙', '사학과3', '678-9012', None),
 ('S010', 'James', 'Computer', '1234', None),
 ('S777', 'Cathy', 'Math', '12345', None),
 ('S888', 'James', 'math', '1234', None),
 ('S999', '홍길동', '컴공', '123', None)]

In [29]:
print(rowList[0])
print(rowList[0][1])

('S001', '박소명', '컴퓨터공학과', '123-4567', None)
박소명

In [30]:
# Insert
sql = 'INSERT INTO student(scode, sname, sdept, sphone, saddress) VALUES(%s, %s, %s, %s, %s)'

In [31]:
curs.execute(sql, ('b001', '유비', '국문학과', '010-1111', '서울'))
curs.execute(sql, ('b002', '관우', '심리학과', '010-2222', '경기'))
curs.execute(sql, ('b003', '장비', '경제학과', '010-3333', '인천'))
conn.commit()

In [32]:
sql  = 'SELECT * FROM student'
curs.execute(sql)
rows = curs.fetchall()
rowList = list(rows)
rowList

[('b001', '유비', '국문학과', '010-1111', '서울'),
 ('b002', '관우', '심리학과', '010-2222', '경기'),
 ('b003', '장비', '경제학과', '010-3333', '인천'),
 ('S001', '박소명', '컴퓨터공학과', '123-4567', None),
 ('S002', '최민국', '컴퓨터공학과', '234-5678', None),
 ('S003', '이승호', '국문학과', '345-6789', None),
 ('S004', '정수봉', '국문학과', '456-7890', None),
 ('S005', '김상진', '사학과', '567-8901', None),
 ('S006', '황정숙', '사학과3', '678-9012', None),
 ('S010', 'James', 'Computer', '1234', None),
 ('S777', 'Cathy', 'Math', '12345', None),
 ('S888', 'James', 'math', '1234', None),
 ('S999', '홍길동', '컴공', '123', None)]

In [33]:
conn.close()

In [34]:
# insert 여러줄
data = (
    ('c001', '조조', '국문학과', '016-1111', '경기'),
    ('c002', '여포', '심리학과', '016-2222', '경기'),
    ('c003', '손견', '경제학과', '016-3333', '경기')
)

In [35]:
sql = 'INSERT INTO student(scode, sname, sdept, sphone, saddress) VALUES(%s, %s, %s, %s, %s)'

In [40]:
curs.executemany(sql, data)
conn.commit()

In [41]:
sql  = 'SELECT * FROM student'
curs.execute(sql)
rows = curs.fetchall()
rowList = list(rows)
rowList

[('b001', '유비', '국문학과', '010-1111', '서울'),
 ('b002', '관우', '심리학과', '010-2222', '경기'),
 ('b003', '장비', '경제학과', '010-3333', '인천'),
 ('c001', '조조', '국문학과', '016-1111', '경기'),
 ('c002', '여포', '심리학과', '016-2222', '경기'),
 ('c003', '손견', '경제학과', '016-3333', '경기'),
 ('S001', '박소명', '컴퓨터공학과', '123-4567', None),
 ('S002', '최민국', '컴퓨터공학과', '234-5678', None),
 ('S003', '이승호', '국문학과', '345-6789', None),
 ('S004', '정수봉', '국문학과', '456-7890', None),
 ('S005', '김상진', '사학과', '567-8901', None),
 ('S006', '황정숙', '사학과3', '678-9012', None),
 ('S010', 'James', 'Computer', '1234', None),
 ('S777', 'Cathy', 'Math', '12345', None),
 ('S888', 'James', 'math', '1234', None),
 ('S999', '홍길동', '컴공', '123', None)]

---
### select 내용을 dataframe으로 보기

In [42]:
# !pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-1.4.46.tar.gz (8.5 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 8.5/8.5 MB 19.4 MB/s eta 0:00:00a 0:00:01
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (setup.py) ... done
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.4.46-cp39-cp39-macosx_11_0_arm64.whl size=1561255 sha256=0f2830aa970ee1d86aa370e09b37dd4244d5e0e433ad111e9f027aa4b307fde9
  Stored in directory: /Users/jyh/Library/Caches/pip/wheels/2e/7a/c5/c4adc0fde658e83ef6ece76c8a7f115fc378c85774d9e5fd42
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-1.4.46

In [43]:
import pandas as pd
from sqlalchemy import create_engine

In [44]:
engine = create_engine('mysql+pymysql://root:qwer1234@127.0.0.1:3306/education')
conn = engine.connect()

In [45]:
data = pd.read_sql_table('student', conn)
data

   scode  sname     sdept    sphone saddress
0   b001     유비      국문학과  010-1111       서울
1   b002     관우      심리학과  010-2222       경기
2   b003     장비      경제학과  010-3333       인천
3   c001     조조      국문학과  016-1111       경기
4   c002     여포      심리학과  016-2222       경기
5   c003     손견      경제학과  016-3333       경기
6   S001    박소명    컴퓨터공학과  123-4567     None
7   S002    최민국    컴퓨터공학과  234-5678     None
8   S003    이승호      국문학과  345-6789     None
9   S004    정수봉      국문학과  456-7890     None
10  S005    김상진       사학과  567-8901     None
11  S006    황정숙      사학과3  678-9012     None
12  S010  James  Computer      1234     None
13  S777  Cathy      Math     12345     None
14  S888  James      math      1234     None
15  S999    홍길동        컴공       123     None

### dataframe을 Database로 Insert하기

In [49]:
column = ['rank', 'title']
movies = pd.read_csv("../Data/DaumList.csv")
movies.columns = column
movies.head()

   rank              title
0     1          아바타: 물의 길
1     2         더 퍼스트 슬램덩크
2     3                 영웅
3     4  장화신은 고양이: 끝내주는 모험
4     5                스위치

In [50]:
engine = create_engine('mysql+pymysql://root:qwer1234@127.0.0.1:3306/daum')
conn = engine.connect()

In [52]:
movies.to_sql(name='movie', con=engine, if_exists='append', index=False)

15

In [53]:
data = pd.read_sql_table('movie', conn)
data

    seq  rank                     title
0     1     1                 아바타: 물의 길
1     2     2                더 퍼스트 슬램덩크
2     3     3                        영웅
3     4     4         장화신은 고양이: 끝내주는 모험
4     5     5                       스위치
5     6     6  오늘 밤, 세계에서 이 사랑이 사라진다 해도
6     7     7                       올빼미
7     8     8   신비아파트 극장판 차원도깨비와 7개의 세계
8     9     9                    프린스 챠밍
9    10    10                        유령
10   11    11                3000년의 기다림
11   12    12                        문맨
12   13    13                       젠틀맨
13   14    14                시간을 꿈꾸는 소녀
14   15    15                  웃는남자 감독판

---
### TinyDB
- NoSQL 문서형 데이터베이스
- MongoDB가 대표적이지만 MongoDB는 설치가 필요하고, TinyDB는 패키지만 설치하면 됨

In [54]:
#!pip install tinydb

Collecting tinydb
  Downloading tinydb-4.7.1-py3-none-any.whl (24 kB)
Installing collected packages: tinydb
Successfully installed tinydb-4.7.1

In [55]:
# TinyDB를 사용하기 위한 라이브러리 불러오기
from tinydb import TinyDB, Query, where

In [56]:
# 데이터베이스 연결하기
filePath = "../Data/tinydb.json"
db = TinyDB(filePath)

In [57]:
# 기존 테이블이 있다면 제거하기
db.drop_table('fruits')

In [59]:
# 테이블 생성하기
table = db.table('fruits')

In [60]:
# 테이블에 데이터 추가하기
table.insert({'name' : 'Banana', 'price' : 6000})

1

In [61]:
table.insert({'name' : 'Orange', 'price' : 12000})
table.insert({'name' : 'Mango', 'price' : 8400})

3

In [62]:
# 모든 데이터 출력
print(table.all())

[{'name': 'Banana', 'price': 6000}, {'name': 'Orange', 'price': 12000}, {'name': 'Mango', 'price': 8400}]

In [63]:
# Orange 검색
item = Query()
res = table.search(item.name == 'Orange')
print(res)

[{'name': 'Orange', 'price': 12000}]

In [77]:
# 가격이 8000원 이상인 과일명만 추출하기
res = table.search(item.price >= 8000)
for i in res:
    print('-', i[0])

- Orange
- Mango

In [78]:
# 수정하기
table.update({'price' : 84000}, item.name == 'Mango')
res = table.search(item.name == 'Mango')
print(res)

[{'name': 'Mango', 'price': 84000}]

In [79]:
# 삭제하기
table.remove(item.name == 'Mango')
print(table.all())

[{'name': 'Banana', 'price': 6000}, {'name': 'Orange', 'price': 12000}]

In [80]:
table.remove(where('name') == 'Orange')
print(table.all())

[{'name': 'Banana', 'price': 6000}]